# 3.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.

perem = ''
if perem:
    print('НЕ пустая строка')
else:
    print('Пустая строка')
# т.к в строке нет ничего она являеться пустой, если же в ней находился хотя-бы пробел , она бы являлась не пустой.