# 9.	Дан список [student1, student2, student3] с помощью цикла for добавить к каждому элементу списка слово “_good”.
# Вывести на экран.


# list_1 = ['student1', 'student2', 'student3']
#
# for i in list_1:
#     if i == "student1":
#         print(i + "_good")
#     elif i == "student2":
#         print(i + "_good")
#     else:
#         print(i + "_good")
#

list_1 = ['student1', 'student2', 'student3']
for i in list_1:
    print(i + '_good')