#1 Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

num1 = 4
num2 = 5
summ = num1 + num2
vct = num1 - num2
umn = num1 * num2
print("Сумма двух чисел: ", summ, "Разность двух чисел: ", vct, "Произведение двух чисел: ", umn)