#3. Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.


rebro = int(input("Введите длинну ребра куба: "))
area = 6 * rebro ** 2
bulk = rebro ** 3
print("Площадь куба: ", area, "Обьём куба: ", bulk )
